slides/HW6-Github.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HW6-Github</title>
<!-- 2014-09-28 Sun 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Jim Blomo"/>
<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">HW6-Github</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. RESTful in Action</a></li>
<li><a href="#sec-2">2. <code>curl</code></a>
<ul>
<li><a href="#sec-2-1">2.1. We'll just use command line</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Show Headers</a></li>
<li><a href="#sec-4">4. Github API</a></li>
<li><a href="#sec-5">5. Homework</a></li>
<li><a href="#sec-6">6. Show Work:slide:</a></li>
<li><a href="#sec-7">7. Don't forget your Project</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> RESTful in Action&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span>&#xa0;<span class="center">center</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
Use Github's API
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <code>curl</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Command-line URL
</li>
<li>Shortcut for manually making Telnet requests
</li>
<li>turned into a library
</li>
</ul>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> We'll just use command line&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Show Headers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-bash">curl -i http://people.ischool.berkeley.edu/~jblomo/webarch2014
</pre>
</div>

<div class="org-src-container">

<pre class="src src-http">HTTP/1.1 200 OK
Date: Fri, 28 Sep 2012 06:25:13 GMT
Server: Apache/2.2.22 (Fedora)
Last-Modified: Fri, 31 Aug 2012 23:27:30 GMT
ETag: "a6ec002-48-4c89822b95c80"
Accept-Ranges: bytes
Content-Length: 72
Content-Type: text/html; charset=UTF-8
</pre>
</div>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #a020f0;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #0000ff;">html</span>&gt;
    &lt;<span style="color: #0000ff;">head</span>&gt;
        &lt;<span style="color: #0000ff;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Jim's Page</span>&lt;/<span style="color: #0000ff;">title</span>&gt;
    &lt;/<span style="color: #0000ff;">head</span>&gt;
    &lt;<span style="color: #0000ff;">body</span>&gt;
        &lt;<span style="color: #0000ff;">p</span>&gt;Hello class! This is a tiny HTML page.&lt;/<span style="color: #0000ff;">p</span>&gt;
    &lt;/<span style="color: #0000ff;">body</span>&gt;
&lt;/<span style="color: #0000ff;">html</span>&gt;
</pre>
</div>
</div>
</div>
