slides/HW6-Github.org
* Homework :slide:
  1. Use the [[http://developer.github.com/v3/users/][Users]] resource to
     discover how many public repositories (=public_repos=) I have (=jblomo=).
  1. Use the [[http://developer.github.com/v3/repos/][Repositories]] resource
     to discover which repositories (=full_name=) I am only a member of.
  1. Use the [[http://developer.github.com/v3/repos/][Repositories]] resource
     to find the =login= s of the contributors to the =mrjob= repository owned
     by =Yelp=
  1. Use the [[http://developer.github.com/v3/repos/commits/][Commits]] resource
     to find what the =message= was of the first commit to the =webarch253=
     repository owned by =jblomo=.

* Show Work:slide:
  + Text file in Pull Request
  + Include answer and curl request used
  + Long responses can be elided

* Don't forget your Project :slide:
  + October 30th (1/5 of your time is gone)
  + There are 4 main parts:
    + HTML to submit the form
    + Handle =POST= to =server/create= to store redirect and return result
    + Handle =GET= to short URL and redirect
    + Handle =GET= to unknown URL and 404


#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
