slides/HW6-Github.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Homework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Use the <a href="http://developer.github.com/v3/users/">Users</a> resource to
discover how many public repositories (<code>public_repos</code>) I have (<code>jblomo</code>).
</li>
<li>Use the <a href="http://developer.github.com/v3/repos/">Repositories</a> resource
to discover which repositories (<code>full_name</code>) I am only a member of.
</li>
<li>Use the <a href="http://developer.github.com/v3/repos/">Repositories</a> resource
to find the <code>login</code> s of the contributors to the <code>mrjob</code> repository owned
by <code>Yelp</code>
</li>
<li>Use the <a href="http://developer.github.com/v3/repos/commits/">Commits</a> resource
to find what the <code>message</code> was of the first commit to the <code>webarch253</code>
repository owned by <code>jblomo</code>.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Show Work:slide:</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Text file in Pull Request
</li>
<li>Include answer and curl request used
</li>
<li>Long responses can be elided
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Don't forget your Project&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>October 30th (1/5 of your time is gone)
</li>
<li>There are 4 main parts:
<ul class="org-ul">
<li>HTML to submit the form
</li>
<li>Handle <code>POST</code> to <code>server/create</code> to store redirect and return result
</li>
<li>Handle <code>GET</code> to short URL and redirect
</li>
<li>Handle <code>GET</code> to unknown URL and 404
</li>
</ul>
</li>
</ul>


<script type="text/javascript" src="production/org-html-slideshow.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jim Blomo</p>
<p class="date">Created: 2014-09-28 Sun 11:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
